/*
 *******************************************************************************
 * Project    ：Coupler
 * Version    ：1.1.1
 * File       ：测试用辅助函数
 * Date       ：01/18/2024
 * Author     ：梁小光
 * Copyright  ：福州水字节科技有限公司
 *******************************************************************************
 */

#pragma once

#include "swmmkernel/swmmkernel.h"

int disconnect_and_return(int err_id)
//------------------------------------------------------------------------------
// 目的：先断开连接，再返回错误号
//------------------------------------------------------------------------------
{
	deleteIDCheckInstance();
	return err_id;
}